-- phpMyAdmin SQL Dump
-- version 5.2.3
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Сен 19 2026 г., 18:29
-- Версия сервера: 8.4.8-8-beget-1-2
-- Версия PHP: 8.3.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `alexpocd_alextec`
--

-- --------------------------------------------------------

--
-- Структура таблицы `banned_words`
--
-- Создание: Сен 19 2026 г., 11:46
-- Последнее обновление: Сен 19 2026 г., 12:27
--

DROP TABLE IF EXISTS `banned_words`;
CREATE TABLE `banned_words` (
  `id` int NOT NULL,
  `word` varchar(100) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `banned_words`
--

INSERT INTO `banned_words` (`id`, `word`) VALUES
(256, 'eblo'),
(260, 'fuck'),
(257, 'huhuy'),
(258, 'hui'),
(259, 'huy'),
(261, 'pidor'),
(262, 'pizda'),
(263, 'pizdec'),
(264, 'ueban'),
(265, 'zalupa'),
(1, 'авотхуй'),
(2, 'ахуеть'),
(3, 'безпезды'),
(4, 'безпизды'),
(5, 'бля'),
(6, 'блябуду'),
(274, 'бляд'),
(7, 'бляди'),
(8, 'блядиада'),
(9, 'блядина'),
(10, 'блядище'),
(11, 'блядский'),
(12, 'блядства'),
(13, 'блядство'),
(14, 'блядушник'),
(15, 'блядь'),
(16, 'блядью'),
(17, 'блять'),
(18, 'взъебну'),
(19, 'взъебнул'),
(20, 'взъебнуть'),
(21, 'впизду'),
(22, 'впиздячил'),
(23, 'вхуярил'),
(24, 'вхуярило'),
(25, 'вхуярить'),
(26, 'выблядок'),
(27, 'выебал'),
(28, 'выебать'),
(29, 'выебон'),
(30, 'гад'),
(31, 'гадина'),
(32, 'гандон'),
(33, 'гандонище'),
(34, 'гандоша'),
(35, 'гнида'),
(36, 'говнюк'),
(37, 'голоёбица'),
(38, 'гомодрила'),
(39, 'гондон'),
(40, 'далбаёбина'),
(41, 'дебил'),
(42, 'дебилойд'),
(43, 'дерьмо'),
(44, 'дибил'),
(45, 'доебался'),
(46, 'долбаеп'),
(47, 'долбоёб'),
(48, 'допизды'),
(49, 'дохуя'),
(50, 'дура'),
(51, 'дурак'),
(52, 'дурачина'),
(53, 'дурень'),
(81, 'ёб'),
(276, 'ебал'),
(54, 'ебало'),
(55, 'ебальник'),
(275, 'ебан'),
(57, 'ебанат'),
(58, 'ебанатик'),
(59, 'ебанатство'),
(56, 'ебанёт'),
(60, 'ебанешь'),
(61, 'ебанул'),
(62, 'ебануться'),
(63, 'ебаныйврот'),
(64, 'ебанько'),
(65, 'ебарь'),
(66, 'ебасос'),
(67, 'ебать'),
(68, 'ебашит'),
(69, 'ебашить'),
(70, 'ебенить'),
(71, 'ебистика'),
(72, 'еблан'),
(73, 'еблище'),
(74, 'еблищу'),
(82, 'ёбля'),
(75, 'ебну'),
(76, 'ебнул'),
(77, 'ебнули'),
(78, 'ебнуть'),
(79, 'ебнуться'),
(80, 'ебсти'),
(277, 'ебуч'),
(83, 'жидоёб'),
(84, 'заебал'),
(85, 'заебался'),
(86, 'заебательский'),
(87, 'заебать'),
(88, 'заебаться'),
(89, 'заебешься'),
(90, 'заебись'),
(91, 'заеблось'),
(92, 'заебнуться'),
(93, 'заебца'),
(278, 'залуп'),
(94, 'залупа'),
(95, 'залупается'),
(96, 'залупаюсь'),
(97, 'залупился'),
(98, 'злоебучий'),
(99, 'идиот'),
(100, 'идиотина'),
(101, 'изъебнулся'),
(102, 'козлоёбина'),
(103, 'лох'),
(104, 'лохудра'),
(105, 'лошара'),
(106, 'лошок'),
(107, 'манда'),
(108, 'мандавошка'),
(109, 'матерщинник'),
(110, 'мозгоёб'),
(279, 'муда'),
(111, 'мудаг'),
(112, 'мудак'),
(113, 'мудила'),
(114, 'мудиле'),
(115, 'мудило'),
(116, 'мудоеб'),
(117, 'мудя'),
(118, 'мудям'),
(119, 'наебал'),
(120, 'наебщик'),
(121, 'невъебенно'),
(122, 'невъебенный'),
(123, 'нецензурщина'),
(124, 'объебал'),
(125, 'однохуйственно'),
(126, 'опёздл'),
(127, 'опизденел'),
(128, 'опизденело'),
(129, 'отпиздил'),
(130, 'отпиздить'),
(131, 'отхуярить'),
(133, 'отъебали'),
(132, 'отъёбанный'),
(134, 'отъебать'),
(135, 'охуевать'),
(136, 'охуевший'),
(137, 'охуеть'),
(139, 'падла'),
(140, 'педик'),
(141, 'педрила'),
(142, 'педриле'),
(143, 'педрилко'),
(144, 'педрило'),
(145, 'педрилу'),
(138, 'пёзды'),
(146, 'пендос'),
(147, 'переебал'),
(148, 'пидар'),
(149, 'пидараз'),
(150, 'пидарас'),
(151, 'пидарюка'),
(152, 'пидор'),
(153, 'пидораз'),
(154, 'пидорас'),
(155, 'пидр'),
(273, 'пизд'),
(156, 'пизда'),
(157, 'пиздабол'),
(158, 'пиздакрыл'),
(159, 'пиздализ'),
(160, 'пиздануть'),
(161, 'пиздатый'),
(162, 'пиздеть'),
(163, 'пиздец'),
(164, 'пиздецкий'),
(165, 'пиздил'),
(166, 'пиздить'),
(167, 'пиздобратия'),
(168, 'пиздоватизм'),
(169, 'пиздоватый'),
(170, 'пиздовать'),
(171, 'пиздокрыл'),
(172, 'пиздос'),
(173, 'пиздуй'),
(174, 'пиздун'),
(176, 'пизды'),
(175, 'пиздюлина'),
(177, 'пиндос'),
(178, 'подиканахуй'),
(179, 'подъебка'),
(180, 'поебать'),
(181, 'поебень'),
(182, 'поебота'),
(183, 'поеботина'),
(184, 'попизде'),
(185, 'попиздили'),
(186, 'похуизм'),
(187, 'похуй'),
(188, 'похую'),
(189, 'пошелнахуй'),
(190, 'пошелпопизде'),
(191, 'придурок'),
(192, 'проебал'),
(193, 'распиздон'),
(194, 'распиздяй'),
(195, 'скотоёб'),
(196, 'скотоебина'),
(197, 'сосихуй'),
(198, 'сосихуйский'),
(199, 'спиздил'),
(200, 'сракохуй'),
(201, 'страхоёбище'),
(202, 'страхуилина'),
(203, 'сука'),
(204, 'сучара'),
(205, 'сучонок'),
(206, 'сцуко'),
(207, 'тупарылый'),
(208, 'тупица'),
(209, 'тупышка'),
(211, 'уебан'),
(212, 'уебать'),
(213, 'уебистче'),
(210, 'уёбище'),
(214, 'урод'),
(215, 'уродец'),
(216, 'уродина'),
(217, 'ушлепок'),
(218, 'хитровыебанная'),
(219, 'хитровыебанный'),
(271, 'хуев'),
(221, 'хуевато'),
(220, 'хуёво'),
(222, 'хуеглот'),
(223, 'хуегрыз'),
(224, 'хуем'),
(225, 'хуеплет'),
(226, 'хуепутало'),
(227, 'хуесос'),
(228, 'хуета'),
(229, 'хуетень'),
(230, 'хуи'),
(231, 'хуило'),
(232, 'хуита'),
(233, 'хуй'),
(234, 'хуйвам'),
(235, 'хуйвамвсем'),
(236, 'хуйвот'),
(237, 'хуйли'),
(238, 'хуйлище'),
(239, 'хуйложу'),
(240, 'хуйморжовый'),
(272, 'хуйн'),
(241, 'хуйнуть'),
(242, 'хуйня'),
(243, 'хуйтам'),
(244, 'хуйтебе'),
(245, 'хулинадо'),
(246, 'хулисмотришь'),
(247, 'хуя'),
(248, 'хуяк'),
(249, 'хуякс'),
(250, 'хуярил'),
(251, 'хуярить'),
(252, 'хуячить'),
(253, 'чмо'),
(254, 'чмошник'),
(255, 'чмырь');

-- --------------------------------------------------------

--
-- Структура таблицы `cart_items`
--
-- Создание: Сен 07 2026 г., 11:01
--

DROP TABLE IF EXISTS `cart_items`;
CREATE TABLE `cart_items` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `product_id` int NOT NULL,
  `quantity` int NOT NULL,
  `added_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `cities`
--
-- Создание: Сен 07 2026 г., 11:01
--

DROP TABLE IF EXISTS `cities`;
CREATE TABLE `cities` (
  `id` int NOT NULL,
  `city_name` varchar(255) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `cities`
--

INSERT INTO `cities` (`id`, `city_name`) VALUES
(1, 'Москва'),
(2, 'Санкт-Петербург'),
(3, 'Новосибирск'),
(4, 'Екатеринбург'),
(5, 'Казань'),
(6, 'Нижний Новгород'),
(7, 'Ростов-на-Дону');

-- --------------------------------------------------------

--
-- Структура таблицы `new_user_carts`
--
-- Создание: Сен 07 2026 г., 11:01
--

DROP TABLE IF EXISTS `new_user_carts`;
CREATE TABLE `new_user_carts` (
  `id` int NOT NULL,
  `user_id` int NOT NULL,
  `product_id` int NOT NULL,
  `quantity` int NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--
-- Создание: Сен 09 2026 г., 09:43
-- Последнее обновление: Сен 19 2026 г., 13:22
--

DROP TABLE IF EXISTS `orders`;
CREATE TABLE `orders` (
  `id` int NOT NULL,
  `city` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `address` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `order_data` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `items_count` int NOT NULL,
  `created_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `city`, `address`, `order_data`, `items_count`, `created_at`) VALUES
(1, 'Москва', '13', '{\"items\":[{\"id\":\"2\",\"name\":\"16\\\" Ноутбук HUAWEI MateBook D 16 2024 MCLF-X серый\",\"price\":54999,\"oldPrice\":null,\"discount\":null,\"category\":\"Ноутбуки\",\"rating\":4.9,\"reviews\":89,\"image\":\"f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg.webp\",\"description\":\"Ноутбук HUAWEI MateBook D 16 2024 MCLF-X диагональю 16\\\" идет без ОС. В основе экрана лежит IPS-матрица с разрешением 1920x1200. Он точно передает цвета и уменьшает нагрузку на зрение благодаря технологиям DC-затемнения и защиты от синего свечения. Это делает устройство удобным для работы с графикой, веб-серфинга, просмотра видео. Видеочип Intel UHD Graphics без задержки обрабатывает графику и выводит ее на дисплей. Он ускоряет воспроизведение видео онлайн.\\r\\nЗа производительность HUAWEI MateBook D 16 2024 MCLF-X отвечает процессор Intel Core i5-12450H с 4 энергоэффективными и 4 производительными ядрами. Он поддерживает 12 потоков и рассчитан на решение профессиональных задач, подходит для поддержки ПО и редактирования видео. LPDDR4x-память объемом 16 ГБ отличается меньшим энергопотреблением. Это повышает быстродействие аппарата за счет разгрузки системы охлаждения. Благодаря SSD-диску объемом 512 ГБ не нужно долго ждать загрузки файлов.\",\"specifications\":\"Процессор:\\r\\nIntel Core i5-12450H (4 + 4 x 2 ГГц + 1.5 ГГц)\\r\\nПамять:\\r\\nОЗУ\\/16 ГБ, SSD\\/512 ГБ\\r\\nОС:\\r\\nбез ОС\\r\\nЭкран:\\r\\n16\\\" (1920x1200)\\r\\nВес:\\r\\n1.72 кг\\r\\nРаскладка клавиатуры:\\r\\nанглийская\\/русская\",\"imageUrl\":\"http:\\/\\/alexpocd.beget.tech\\/assets\\/images\\/f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg.webp\",\"quantity\":3}],\"total\":164997,\"city\":\"Москва\",\"address\":\"13\",\"date\":\"2026-09-09T09:45:54.938Z\"}', 3, '2026-09-09 09:45:56'),
(2, 'Москва', 'h', '{\"items\":[{\"id\":\"5\",\"name\":\"43\\\" (108 см) Телевизор Xiaomi TV A 43 2026 черный\",\"price\":25999,\"oldPrice\":32999,\"discount\":\"13\",\"category\":\"Телевизоры\",\"rating\":4.5,\"reviews\":92,\"image\":\"6d15582c93b7c52895ebbec99067b3d5c1bf6f1c3492f3eb03c03b7c0d912498.jpg.webp\",\"description\":\"Телевизор Xiaomi TV A 43 2026 оснащен 43-дюймовым экраном. Панель с разрешением 4K UltraHD обеспечивает четкую передачу деталей. Технология DC Dimming плавно настраивает яркость и исключает мерцание подсветки. Благодаря технологии HDR обеспечиваются детализация света и теней, глубокие натуральные оттенки. Режим Filmmaker отключает функции обработки и сохраняет оригинальное качество воспроизведение фильма. Режим защиты зрения уберегает глаза от негативного синего света и делает комфортным просмотр.\\r\\nТелевизор Xiaomi TV A 43 2026 выполнен в корпусе с безрамочным дизайном и металлической окантовкой. Акустическая система мощностью 20 Вт с технологиями DTS:X и Dolby Audio воспроизводит объемный чистый звук. Платформа Smart TV под управлением ОС Android TV открывает доступ к развлекательному контенту на потоковых сервисах Wink, Ivi, Okko, Rutube и других. Пульт ДУ оснащен голосовым помощником Google. Это делает простым поиск информации и управление телевизором. Для беспроводной синхронизации с устройствами реализованы модули Bluetooth 5.0 и Wi-Fi.\",\"specifications\":\"Экран:\\r\\n43\\\", 4K UltraHD, 3840x2160\\r\\nSmart TV, Wi-Fi, BT:\\r\\nесть\\r\\nЧастота обновления экрана:\\r\\n60 Гц\\r\\nОС:\\r\\nAndroid TV\\r\\nТип подсветки LED:\\r\\nDirect LED\\r\\nРазмер VESA:\\r\\n100 x 200\",\"imageUrl\":\"http:\\/\\/alexpocd.beget.tech\\/assets\\/images\\/6d15582c93b7c52895ebbec99067b3d5c1bf6f1c3492f3eb03c03b7c0d912498.jpg.webp\",\"quantity\":1}],\"total\":25999,\"city\":\"Москва\",\"address\":\"h\",\"date\":\"2026-09-09T15:09:43.127Z\"}', 1, '2026-09-09 15:09:43'),
(3, 'Екатеринбург', 'dfjgfhkj', '{\"items\":[{\"id\":\"2\",\"name\":\"16\\\" Ноутбук HUAWEI MateBook D 16 2024 MCLF-X серый\",\"price\":54999,\"oldPrice\":null,\"discount\":null,\"category\":\"Ноутбуки\",\"rating\":4.9,\"reviews\":89,\"image\":\"f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg.webp\",\"description\":\"Ноутбук HUAWEI MateBook D 16 2024 MCLF-X диагональю 16\\\" идет без ОС. В основе экрана лежит IPS-матрица с разрешением 1920x1200. Он точно передает цвета и уменьшает нагрузку на зрение благодаря технологиям DC-затемнения и защиты от синего свечения. Это делает устройство удобным для работы с графикой, веб-серфинга, просмотра видео. Видеочип Intel UHD Graphics без задержки обрабатывает графику и выводит ее на дисплей. Он ускоряет воспроизведение видео онлайн.\\r\\nЗа производительность HUAWEI MateBook D 16 2024 MCLF-X отвечает процессор Intel Core i5-12450H с 4 энергоэффективными и 4 производительными ядрами. Он поддерживает 12 потоков и рассчитан на решение профессиональных задач, подходит для поддержки ПО и редактирования видео. LPDDR4x-память объемом 16 ГБ отличается меньшим энергопотреблением. Это повышает быстродействие аппарата за счет разгрузки системы охлаждения. Благодаря SSD-диску объемом 512 ГБ не нужно долго ждать загрузки файлов.\",\"specifications\":\"Процессор:\\r\\nIntel Core i5-12450H (4 + 4 x 2 ГГц + 1.5 ГГц)\\r\\nПамять:\\r\\nОЗУ\\/16 ГБ, SSD\\/512 ГБ\\r\\nОС:\\r\\nбез ОС\\r\\nЭкран:\\r\\n16\\\" (1920x1200)\\r\\nВес:\\r\\n1.72 кг\\r\\nРаскладка клавиатуры:\\r\\nанглийская\\/русская\",\"imageUrl\":\"http:\\/\\/alexpocd.beget.tech\\/assets\\/images\\/f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg.webp\",\"quantity\":1}],\"total\":54999,\"city\":\"Екатеринбург\",\"address\":\"dfjgfhkj\",\"date\":\"2026-09-09T15:40:17.725Z\"}', 1, '2026-09-09 15:40:16'),
(4, 'Москва', '3', '{\"items\":[{\"id\":\"2\",\"name\":\"16\\\" Ноутбук HUAWEI MateBook D 16 2024 MCLF-X серый\",\"price\":54999,\"oldPrice\":null,\"discount\":null,\"category\":\"Ноутбуки\",\"rating\":4.9,\"reviews\":89,\"image\":\"f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg.webp\",\"description\":\"Ноутбук HUAWEI MateBook D 16 2024 MCLF-X диагональю 16\\\" идет без ОС. В основе экрана лежит IPS-матрица с разрешением 1920x1200. Он точно передает цвета и уменьшает нагрузку на зрение благодаря технологиям DC-затемнения и защиты от синего свечения. Это делает устройство удобным для работы с графикой, веб-серфинга, просмотра видео. Видеочип Intel UHD Graphics без задержки обрабатывает графику и выводит ее на дисплей. Он ускоряет воспроизведение видео онлайн.\\r\\nЗа производительность HUAWEI MateBook D 16 2024 MCLF-X отвечает процессор Intel Core i5-12450H с 4 энергоэффективными и 4 производительными ядрами. Он поддерживает 12 потоков и рассчитан на решение профессиональных задач, подходит для поддержки ПО и редактирования видео. LPDDR4x-память объемом 16 ГБ отличается меньшим энергопотреблением. Это повышает быстродействие аппарата за счет разгрузки системы охлаждения. Благодаря SSD-диску объемом 512 ГБ не нужно долго ждать загрузки файлов.\",\"specifications\":\"Процессор:\\r\\nIntel Core i5-12450H (4 + 4 x 2 ГГц + 1.5 ГГц)\\r\\nПамять:\\r\\nОЗУ\\/16 ГБ, SSD\\/512 ГБ\\r\\nОС:\\r\\nбез ОС\\r\\nЭкран:\\r\\n16\\\" (1920x1200)\\r\\nВес:\\r\\n1.72 кг\\r\\nРаскладка клавиатуры:\\r\\nанглийская\\/русская\",\"imageUrl\":\"http:\\/\\/alexpocd.beget.tech\\/assets\\/images\\/f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg.webp\",\"quantity\":2}],\"total\":109998,\"city\":\"Москва\",\"address\":\"3\",\"date\":\"2026-09-13T18:20:35.878Z\"}', 2, '2026-09-13 18:20:40'),
(5, 'Москва', '335', '{\"items\":[{\"id\":\"14\",\"name\":\"Беспроводные\\/проводные наушники Marshall Major V черный 2024\",\"price\":8199,\"oldPrice\":9499,\"discount\":\"23\",\"category\":\"Аудиотехника\",\"rating\":4.7,\"reviews\":201,\"image\":\"7dde57929a7052a80ee0cb23bea558c3e2fefe222cb4e3c3b38015d9e9585f6f.jpg.webp\",\"description\":\"Накладные наушники Marshall Major V в черном цвете имеют формат стереосистемы 2.0. Он предполагает равномерное распределение звука по двум колонкам и обеспечивает чистый, объемный звук в частотном диапазоне от 20 до 20000 Гц. Это значит, что в этих наушниках будет комфортно прослушивать музыку как с высокими нотами, так и с басами.\\r\\nНаушники Marshall Major V можно подключить к смартфону по Bluetooth на расстоянии до 10 м. На одном заряде устройство будет проигрывать аудио до 100 ч. Восстановить заряд можно с помощью функции быстрой зарядки через кабель USB Type-C из комплекта. Для проводного подключения телефона предусмотрен кабель кабель jack 2.5 mm - jack 3.5 mm. На смартфон можно скачать приложение Marshall Bluetooth для управления. Переключать треки, ставить их на паузу, а также принимать звонки вы сможете также через голосового помощника или механическими кнопками.\",\"specifications\":\"Тип конструкции:\\r\\nнакладные\\r\\nТип соединения:\\r\\nпроводной, Bluetooth 5.3, кабель 1.2 м\\r\\nВремя работы:\\r\\nдо 100 ч\\r\\nБеспроводная зарядка:\\r\\nесть\\r\\nДиапазон частот:\\r\\n20 Гц - 20000 Гц\\r\\nСопротивление:\\r\\n32Ω\",\"imageUrl\":\"http:\\/\\/alexpocd.beget.tech\\/assets\\/images\\/7dde57929a7052a80ee0cb23bea558c3e2fefe222cb4e3c3b38015d9e9585f6f.jpg.webp\",\"quantity\":2}],\"total\":16398,\"city\":\"Москва\",\"address\":\"335\",\"date\":\"2026-09-13T18:30:57.045Z\"}', 2, '2026-09-13 18:31:01'),
(6, 'Москва', 'улица хуева кукуева', '{\"items\":[{\"id\":\"2\",\"name\":\"16\\\" Ноутбук HUAWEI MateBook D 16 2024 MCLF-X серый\",\"price\":54999,\"oldPrice\":null,\"discount\":null,\"category\":\"Ноутбуки\",\"rating\":4.9,\"reviews\":89,\"image\":\"f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg.webp\",\"description\":\"Ноутбук HUAWEI MateBook D 16 2024 MCLF-X диагональю 16\\\" идет без ОС. В основе экрана лежит IPS-матрица с разрешением 1920x1200. Он точно передает цвета и уменьшает нагрузку на зрение благодаря технологиям DC-затемнения и защиты от синего свечения. Это делает устройство удобным для работы с графикой, веб-серфинга, просмотра видео. Видеочип Intel UHD Graphics без задержки обрабатывает графику и выводит ее на дисплей. Он ускоряет воспроизведение видео онлайн.\\r\\nЗа производительность HUAWEI MateBook D 16 2024 MCLF-X отвечает процессор Intel Core i5-12450H с 4 энергоэффективными и 4 производительными ядрами. Он поддерживает 12 потоков и рассчитан на решение профессиональных задач, подходит для поддержки ПО и редактирования видео. LPDDR4x-память объемом 16 ГБ отличается меньшим энергопотреблением. Это повышает быстродействие аппарата за счет разгрузки системы охлаждения. Благодаря SSD-диску объемом 512 ГБ не нужно долго ждать загрузки файлов.\",\"specifications\":\"Процессор:\\r\\nIntel Core i5-12450H (4 + 4 x 2 ГГц + 1.5 ГГц)\\r\\nПамять:\\r\\nОЗУ\\/16 ГБ, SSD\\/512 ГБ\\r\\nОС:\\r\\nбез ОС\\r\\nЭкран:\\r\\n16\\\" (1920x1200)\\r\\nВес:\\r\\n1.72 кг\\r\\nРаскладка клавиатуры:\\r\\nанглийская\\/русская\",\"imageUrl\":\"http:\\/\\/alexpocd.beget.tech\\/assets\\/images\\/f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg.webp\",\"quantity\":1},{\"id\":\"1\",\"name\":\"6.7\\\" Смартфон Samsung Galaxy A56 256 ГБ черный\",\"price\":32999,\"oldPrice\":60999,\"discount\":14,\"category\":\"Смартфоны\",\"rating\":4.8,\"reviews\":124,\"image\":\"831a385f76f265293448bc5b858ab3d74053e6cf4ada47e0649b959d7bcb5567.jpg.webp\",\"saleEnds\":\"2026-11-25\",\"imageUrl\":\"http:\\/\\/alexpocd.beget.tech\\/assets\\/images\\/831a385f76f265293448bc5b858ab3d74053e6cf4ada47e0649b959d7bcb5567.jpg.webp\",\"quantity\":3}],\"total\":153996,\"city\":\"Москва\",\"address\":\"улица хуева кукуева\",\"date\":\"2026-09-16T16:13:26.059Z\"}', 4, '2026-09-16 16:13:25');

-- --------------------------------------------------------

--
-- Структура таблицы `products`
--
-- Создание: Сен 07 2026 г., 11:01
-- Последнее обновление: Сен 19 2026 г., 14:50
--

DROP TABLE IF EXISTS `products`;
CREATE TABLE `products` (
  `id` int NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `price` decimal(10,2) DEFAULT NULL,
  `oldPrice` decimal(10,2) DEFAULT NULL,
  `discount` int DEFAULT NULL,
  `category` varchar(50) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `rating` decimal(3,1) DEFAULT NULL,
  `reviews` int DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `description` text COLLATE utf8mb4_general_ci,
  `specifications` text COLLATE utf8mb4_general_ci
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `products`
--

INSERT INTO `products` (`id`, `name`, `price`, `oldPrice`, `discount`, `category`, `rating`, `reviews`, `image`, `description`, `specifications`) VALUES
(1, '6.1\" Смартфон Apple iPhone 15 128 ГБ черный', 56999.00, 60999.00, 14, 'Смартфоны', 4.8, 124, '2258685cc32bbd96de406852bd9b2d94916029658cd6fa120a9f97a4bc0af297.jpg.webp', 'Встречайте смартфон Apple iPhone 15. Он не оставит вас в беде благодаря экстренному оповещению через спутник и функцию определения аварии. Помощь придет в самый нужный момент.\r\nМодель отличается стильным внешним видом. Непревзойденное сочетание цвета и долговечности: стекло и алюминий в едином дизайне. Корпус Apple iPhone 15 выполнен из 75% переработанного алюминия.\r\nЧип A16 Bionic демонстрирует невероятную мощь, признанную экспертами. Заряда устройства хватает на весь день для всего, что вам по душе. Смотрите видео до 20 часов. Для подзарядки аккумулятора воспользуйтесь разъемом USB Type-C.\r\nОсновная камера 48 Мп с 2-кратным телеобъективом позволит делать снимки в высочайшем разрешении.', 'Дисплей:\r\n6.1\", 2556x1179, Super Retina XDR, 60 Гц\r\nСвязь:\r\n3G, 4G, 5G, eSIM, Nano-SIM\r\nПроцессор:\r\nApple A16 Bionic, 6 x 3.46 ГГц\r\nПамять (ОЗУ/ПЗУ):\r\n6 ГБ / 128 ГБ\r\nКамера:\r\n48+12 Мп\r\nПитание:\r\n3349 мА*ч (Li-Ion)'),
(2, '16\" Ноутбук HUAWEI MateBook D 16 2024 MCLF-X серый', 54999.00, NULL, NULL, 'Ноутбуки', 4.9, 89, 'f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg.webp', 'Ноутбук HUAWEI MateBook D 16 2024 MCLF-X диагональю 16\" идет без ОС. В основе экрана лежит IPS-матрица с разрешением 1920x1200. Он точно передает цвета и уменьшает нагрузку на зрение благодаря технологиям DC-затемнения и защиты от синего свечения. Это делает устройство удобным для работы с графикой, веб-серфинга, просмотра видео. Видеочип Intel UHD Graphics без задержки обрабатывает графику и выводит ее на дисплей. Он ускоряет воспроизведение видео онлайн.\r\nЗа производительность HUAWEI MateBook D 16 2024 MCLF-X отвечает процессор Intel Core i5-12450H с 4 энергоэффективными и 4 производительными ядрами. Он поддерживает 12 потоков и рассчитан на решение профессиональных задач, подходит для поддержки ПО и редактирования видео. LPDDR4x-память объемом 16 ГБ отличается меньшим энергопотреблением. Это повышает быстродействие аппарата за счет разгрузки системы охлаждения. Благодаря SSD-диску объемом 512 ГБ не нужно долго ждать загрузки файлов.', 'Процессор:\r\nIntel Core i5-12450H (4 + 4 x 2 ГГц + 1.5 ГГц)\r\nПамять:\r\nОЗУ/16 ГБ, SSD/512 ГБ\r\nОС:\r\nбез ОС\r\nЭкран:\r\n16\" (1920x1200)\r\nВес:\r\n1.72 кг\r\nРаскладка клавиатуры:\r\nанглийская/русская'),
(3, 'Беспроводные наушники Logitech G435 черный 2021', 4999.00, 6499.00, 23, 'Аудиотехника', 4.7, 201, '73dd06c0a2d4c9ff74cfaafaedec60012cae0a437e72ed35351e0fa8fa203289.jpg.webp', 'Оснащенная мягкими амбушюрами и регулируемым оголовьем радиочастотная гарнитура Logitech G435 LIGHTSPEED исключительно комфортна. Эксплуатация устройства в течение многих часов подряд не доставит пользователю неудобств. Это актуально: гарнитура ориентирована на использование в играх. Модель совместима с консолями Nintendo Switch, PS4 и PS5. Одной из особенностей гарнитуры является поддержка технологии объемного звука Dolby Atmos.\r\nРадиочастотная гарнитура Logitech G435 LIGHTSPEED поддерживает два способа подключения – Bluetooth и радиоканал. Модель имеет закрытое акустическое оформление. Наушники устройства надежно ограждают пользователя от звуков внешнего мира. Воспроизведение осуществляется в широком частотном диапазоне – от 20 Гц до 20 кГц. Передача голоса осуществляется «усилиями» микрофона, встроенного в корпус.\r\nМаксимальное время работы гарнитуры без подзарядки аккумулятора составляет 18 ч. Устройство легкое: его масса равна лишь 165 г. Гарнитура имеет практичный черный цвет. Любые загрязнения на темном фоне малозаметны. Цвет дополнительных элементов – желтый.', 'Тип конструкции:\r\nохватывающие\r\nТип соединения:\r\nрадиоканал\r\nВремя работы:\r\nдо 18 ч\r\nСовместимость с консолями:\r\nNintendo Switch, PS4, PS5\r\nДиапазон частот:\r\n20 Гц - 20000 Гц\r\nСопротивление:\r\n45Ω'),
(4, '11.5\" Планшет HUAWEI MatePad 11.5 (2025) Wi-Fi 256 ГБ фиолетовый + клавиатура + чехол', 30999.00, 24999.00, 20, 'Планшеты', 4.6, 76, '4c50e9737ae8188a63bd98b1bfeb429bef560e3599fea1c03b45e8d06bb400cb.jpg.webp', 'Планшет HUAWEI MatePad 11.5 Wi-Fi 256 ГБ выполнен в цельнометаллическом корпусе фиолетового цвета. Для удобной работы в программах WPS Office в комплекте предусмотрена отсоединяемая клавиатура. Стабильная производительность без зависаний при запуске приложений, игр, мультимедийного контента, веб-страниц достигается процессором HiSilicon Kirin T82B и 8 ГБ оперативной памяти.\r\nПланшет оснащен экраном диагональю 11.5 дюйма. Матрица IPS с разрешением 2456x1600 пикселей обеспечивает четкие детали и яркие натуральные оттенки. Частота обновления 120 Гц гарантирует плавные переходы при просмотре динамичного видео и в играх. Камеры с разрешением 13 Мп и 8 Мп создают четкие фотографии и видеоролики. Акустическая система с четырьмя динамиками при поддержке аудиоэффектов HUAWEI Histen 9.0 воспроизводит объемное чистое звучание. В режиме просмотра видео одного заряда аккумулятора емкостью 10100 мА*ч хватает до 14 часов автономной работы планшета HUAWEI MatePad 11.5.', 'Дисплей:\r\n2456x1600, IPS, 120 Гц\r\nОС:\r\nHarmonyOS 4.3\r\nПроцессор:\r\nHiSilicon Kirin T82B, 8x2.29 ГГц\r\nПамять (ОЗУ/ПЗУ):\r\n8 ГБ/256 ГБ\r\nСвязь:\r\nWi-Fi 4 (802.11n), 5 (802.11ac), 6 (802.11ax)\r\nПитание:\r\n10100 мА*ч'),
(5, '43\" (108 см) Телевизор Xiaomi TV A 43 2026 черный', 25999.00, 32999.00, 13, 'Телевизоры', 4.5, 92, '6d15582c93b7c52895ebbec99067b3d5c1bf6f1c3492f3eb03c03b7c0d912498.jpg.webp', 'Телевизор Xiaomi TV A 43 2026 оснащен 43-дюймовым экраном. Панель с разрешением 4K UltraHD обеспечивает четкую передачу деталей. Технология DC Dimming плавно настраивает яркость и исключает мерцание подсветки. Благодаря технологии HDR обеспечиваются детализация света и теней, глубокие натуральные оттенки. Режим Filmmaker отключает функции обработки и сохраняет оригинальное качество воспроизведение фильма. Режим защиты зрения уберегает глаза от негативного синего света и делает комфортным просмотр.\r\nТелевизор Xiaomi TV A 43 2026 выполнен в корпусе с безрамочным дизайном и металлической окантовкой. Акустическая система мощностью 20 Вт с технологиями DTS:X и Dolby Audio воспроизводит объемный чистый звук. Платформа Smart TV под управлением ОС Android TV открывает доступ к развлекательному контенту на потоковых сервисах Wink, Ivi, Okko, Rutube и других. Пульт ДУ оснащен голосовым помощником Google. Это делает простым поиск информации и управление телевизором. Для беспроводной синхронизации с устройствами реализованы модули Bluetooth 5.0 и Wi-Fi.', 'Экран:\r\n43\", 4K UltraHD, 3840x2160\r\nSmart TV, Wi-Fi, BT:\r\nесть\r\nЧастота обновления экрана:\r\n60 Гц\r\nОС:\r\nAndroid TV\r\nТип подсветки LED:\r\nDirect LED\r\nРазмер VESA:\r\n100 x 200'),
(6, 'Смарт-часы Apple Watch SE 3 40 mm', 26099.00, 28999.00, 2, 'Умные часы', 4.4, 156, 'f669b852c62ac46ba3ee888d63a43d8a5d896a1f38e2cca75c142f3d87eaf909.jpg.webp', 'Смарт-часы Apple Watch SE 3 обладают прямоугольным бежевым корпусом шириной 4 см из алюминия. Его водонепроницаемость составляет 5 бар, благодаря чему устройство не боится капель и брызг воды.\r\nСенсорный OLED-экран передает множество оттенков. Устройство измеряет продолжительность и качество сна (включая уведомление об апноэ), пульс, уровень стресса и восстановления. У него также есть 14 программ тренировок и полезные опции для бега, велоспорта и плавания. Apple Watch SE 3 дополнены платформой искусственного интеллекта Apple Intelligence. При взаимодействии со смартфоном часам доступно дистанционное управление воспроизведением музыки, уведомления о SMS, звонках, от приложений. Бежевый ремешок часов выполнен из эластомера.', 'Экран:\r\n1.57\" OLED, 394x324\r\nИзмерения:\r\nпродолжительность и качество сна, пульс, уровень стресса и восстановление\r\nВремя работы:\r\n32 ч\r\nБеспроводная связь:\r\nBluetooth, NFC, Wi-Fi\r\nНавигация:\r\nBeiDou, Galileo, GPS, QZSS'),
(7, '6.67\" Смартфон Xiaomi Redmi Note 14 256 ГБ черный', 56999.00, 60999.00, 14, 'Смартфоны', 4.8, 124, 'd242d02b93b30a304475ef2569e05a4b67123d1c80fec310082000dbb8f7995c.jpg.webp', 'Xiaomi Redmi Note 14 Pro+ 5G — это мощный и стильный смартфон с большим экраном и высоким разрешением. Устройство оснащено ярким и чётким AMOLED-дисплеем с диагональю 6,67 дюймов и разрешением 2712x1220 пикселей, который обеспечивает отличное качество изображения и комфортное использование.\r\nСмартфон работает на базе операционной системы Android 14 с фирменной оболочкой HyperOS, которая предлагает удобный и интуитивно понятный интерфейс.\r\nXiaomi Redmi Note 14 Pro+ 5G оснащён мощным процессором Snapdragon 7s Gen 3, что обеспечивает быструю и плавную работу устройства. Смартфон также имеет большой объём оперативной памяти, что позволяет ему легко справляться с многозадачностью и запускать требовательные приложения.\r\nТройная основная камера с оптической стабилизацией позволяет делать качественные и яркие фотографии и видео.\r\nСмартфон имеет ёмкий аккумулятор на 5110 мАч, что обеспечивает длительное время работы без подзарядки. Xiaomi Redmi Note 14 Pro+ 5G также поддерживает быструю зарядку мощностью 120 Вт, что позволяет быстро восстановить заряд батареи.', 'Дисплей:\r\n6.67\", 2712x1220, AMOLED, 120 Гц\r\nСвязь:\r\n3G, 4G, 5G, Nano-SIM\r\nПроцессор:\r\nQualcomm Snapdragon 7s Gen 3, 8 x 2.5 ГГц\r\nПамять (ОЗУ/ПЗУ):\r\n12 ГБ / 256 ГБ\r\nКамера:\r\n200+8+2 Мп\r\nПитание:\r\n5110 мА*ч (Li-Pol)'),
(8, '6.7\" Смартфон Samsung Galaxy A56 256 ГБ черный', 32999.00, 60999.00, 14, 'Смартфоны', 4.8, 124, '831a385f76f265293448bc5b858ab3d74053e6cf4ada47e0649b959d7bcb5567.jpg.webp', 'Samsung Galaxy A56 предлагает функции искусственного интеллекта. Мгновенный поиск с помощью Surround to Search, персональный помощник Gemini, редактируйте фотографии с помощью Object Eraser, персонализируйте снимки с помощью фильтров, создавайте видеоролики за считанные секунды с помощью функции редактирования на основе искусственного интеллекта и каждый раз делайте великолепные групповые снимки с помощью Best Pose.\r\nБольше, ярче, мощнее. 6,7-дюймовый FHD+ Super AMOLED-экран стал больше и ярче до 1200 нит, а улучшенный процессор обеспечивает высокую производительность. Galaxy A56 5G имеет сертификат водонепроницаемости IP67, что делает его устойчивым к воздействию воды и пыли. Различные датчики Galaxy A56 были улучшены для повышения качества изображения. Запечатлейте невероятные моменты в высоком разрешении: с помощью сверхширокоугольного объектива 12 МП, основного датчика 50 МП, макродатчика 5 МП на задней панели, а также 12 МП фронтальной камеры (селфи).\r\nЕмкость аккумулятора Galaxy A56 составляет 5000 мАч. Он обеспечивает до 29 часов воспроизведения видео и до 2,5 дней автономной работы.', 'Дисплей:\r\n6.7\", 2340x1080, Super AMOLED, 120 Гц\r\nСвязь:\r\n3G, 4G, 5G, eSIM, Nano-SIM\r\nПроцессор:\r\nSamsung Exynos 1580, 8 x 2.9 ГГц\r\nПамять (ОЗУ/ПЗУ):\r\n8 ГБ / 256 ГБ\r\nКамера:\r\n50+12+5 Мп\r\nПитание:\r\n5000 мА*ч (Li-Pol)'),
(9, '13.6\" Ноутбук Apple MacBook Air M4 серебристый', 94999.00, 105499.00, 14, 'Ноутбуки', 4.8, 124, 'ad01cc5e1b26d2babbb87e8bbaacce13612222ffb9b39b939605a9023e9c8f03.png.webp', 'Apple MacBook Air M4 — ультратонкий и легкий ноутбук, объединяющий элегантный дизайн и высокую производительность. Благодаря энергоэффективности и бесшумной работе он отлично подходит для повседневных задач, работы и творчества. Это стильное и надежное устройство для тех, кто ценит удобство и качество.', 'Процессор:\r\nApple M4 10-core (4 + 6)\r\nПамять:\r\nОЗУ/16 ГБ, SSD/256 ГБ\r\nОС:\r\nmacOS\r\nЭкран:\r\n13.6\" (2560x1664)\r\nВес:\r\n1.24 кг\r\nРаскладка клавиатуры:\r\nанглийская/русская'),
(10, '17.3\" Ноутбук ASUS TUF Gaming FX707VJ-HX015 серый', 88999.00, 90999.00, 14, 'Ноутбуки', 4.8, 124, '98ebc786ba1821e79ded93dfb338087cabbbe840a96d389b8151c615f27420d7.jpg.webp', '17.3\" Ноутбук ASUS TUF Gaming (FX707VJ-HX015)(FHD/IPS) Core 5 210H/16384/SSD 512/NV RTX3050/DOS/Mecha Gray в сером корпусе – игровая модель. В нее установлен 17.3 дюймовый дисплей. В экран встроена IPS-матрица, которая передает картинку в формате Full HD. Частота обновления кадров составляет 144 Гц. Благодаря этому изображение будет плавным и без разрывов даже в динамичных игровых сценах.\r\nВ 17.3\" Ноутбук ASUS TUF Gaming (FX707VJ-HX015)(FHD/IPS) Core 5 210H/16384/SSD 512/NV RTX3050/DOS/Mecha Gray установлен процессор Intel Core 5 210H с 8 ядрами. Он разгоняется до 4.8 ГГц и справляется с высокими нагрузками. Видеокарта NVIDIA GeForce RTX 3050 с 6 ГБ GDDR6 поддерживает большинство игр и подходит для работы в графических приложениях. 16 Гб оперативной памяти позволяют запускать несколько приложений одновременно, не снижая производительность ноутбука. На SSD на 512 Гб можно хранить большой объем документов и файлов мультимедиа. Корпус ноутбука комбинированный, сделан из металла и пластика. Встроенные динамик и микрофон позволяют общаться с другими геймерами в процессе игры.', 'Процессор:\r\nIntel Core 5 210H (4 + 4 x 2.2 ГГц + 1.6 ГГц)\r\nПамять:\r\nОЗУ/16 ГБ, SSD/512 ГБ\r\nВидеокарта:\r\nGeForce RTX 3050 для ноутбуков / 6 ГБ\r\nОС:\r\nбез ОС\r\nЭкран:\r\n17.3\" (1920x1080)'),
(11, '24\" (61 см) Телевизор Aceline 24HEN2 черный', 6199.00, 10000.00, 14, 'Телевизоры', 4.8, 124, 'ab7c0179d9f377fc23be740ae96168658c20a36166f7877887620fccdf3287a7.jpg.webp', 'LED-телевизор Aceline 24HEN2 с диагональю экрана 24 дюйма подойдет для детской комнаты, кухни, спальни. Панель VA с разрешением 1366x768 пикселей и контрастностью 3000:1 отображает четкое красочное изображение. Тонкая рамка обеспечивает погружение в просмотр.\r\nАкустическая система мощностью 10 Вт при поддержке технологии Dolby Digital формирует объемное звучание. В телевизоре Aceline 24HEN2 реализован цифровой тюнер с поддержкой стандартов DVB-C, DVB-S, DVB-S2, DVB-T и DVB-T2. Три разъема HDMI 1.4 предоставляют возможность подключения игровой консоли и видеотехники.', 'Экран:\r\n24\", HD, 1366x768\r\nЧастота обновления экрана:\r\n60 Гц\r\nТип подсветки LED:\r\nDirect LED\r\nРазмер VESA:\r\n100 x 100\r\nС подставкой.:\r\n534.8 мм х353.2 мм x150.5 мм\r\nТюнеры:\r\nDVB-C, DVB-S, DVB-S2, DVB-T'),
(12, '50\" (127 см) Телевизор Xiaomi TV A Pro 50 2026 черный', 32999.00, 40999.00, 14, 'Телевизоры', 4.8, 124, '463aa9acfebc92bf7dd1c5809e07036bde6049290d3f889d2f99e8656809e472.jpg.webp', 'Черный телевизор 50\"(127 см) Xiaomi TV A Pro 50 2026 с диагональю экрана 50 дюймов подойдет для спальни или детской комнаты. Изображение выводится в разрешении 4K UltraHD, чтобы вы смогли увидеть мельчайшие детали без размытия и зернистости. Экран отображает 94% цветового спектра DCI-P3, который применяется в цифровом кинематографе. Благодаря этому картинка выглядит насыщенной, яркой и реалистичной. Если вы активируете режим FILMMAKER, то сможете смотреть фильмы в задуманной создателями цветопередаче. Технология MEMC сглаживает кадры, что делает комфортным просмотр динамичных фильмов. Режим Game Boost повышает частоту обновления экрана до 120 Гц при подключении через HDMI, за счет чего достигается плавность анимации в играх.\r\nТелевизор 50\"(127 см) Xiaomi TV A Pro 50 2026 поддерживает Smart TV на базе Android 14. Это открывает доступ к приложениям, онлайн-кинотеатрам и стриминговым сервисам. Управлять функциями, настройками и искать контент можно с помощью голосового помощника Google Assistant. В модели применяется технология защиты зрения, которая уменьшает мерцание и воздействие синего цвета. Поддержка Google Cast и Miracast позволяет транслировать на экран изображение со смартфона и планшета без проводного подключения.', 'Экран:\r\n50\", 4K UltraHD, 3840x2160\r\nQLED, Smart TV, Wi-Fi, BT:\r\nесть\r\nЧастота обновления экрана:\r\n60 Гц\r\nОС:\r\nAndroid TV\r\nТип подсветки LED:\r\nDirect LED\r\nРазмер VESA:\r\n100 x 200'),
(13, 'Наушники TWS Apple AirPods Pro 3 белый 2025', 23499.00, 30499.00, 23, 'Аудиотехника', 4.7, 201, '313c94e5085fa534b5afa8c9af2c45d36bf847fa53e577853ecd7ee1d25b38eb.jpg.webp', 'Наушники TWS Apple AirPods Pro 3 2025 выполнены в белом цвете. Влагозащищенный корпус позволит активно заниматься спортом, в том числе на улице во время атмосферных осадков. Модель позволит контролировать частоту сердечных сокращений. Закрытое акустическое оформление обеспечит шумоизоляцию от звуков извне. Для безопасного использования наушников на улице предусмотрен режим Talk Through. Динамические излучатели гарантируют оптимальное звучание любого аудио-контента. Эквалайзер позволит настроить низкие и высокие частоты под жанр музыки. В корпус каждого наушника встроен микрофон с шумоподавлением, поэтому общение без посторонних звуков обеспечено. TWS Apple AirPods Pro 3 2025 управляются со смартфона, голосом и с помощью сенсорных клавиш на наушниках. Встроенный ИИ-переводчик позволит общаться и слушать лекции на иностранном языке. Акселерометр обеспечит автоматическое отключение наушников, когда пользователь достает их из ушей, и включение – когда устройство вставляется в ухо. Модель может выполнять функцию слухового аппарата.', 'Тип конструкции:\r\nвнутриканальные\r\nТип соединения:\r\nBluetooth 5.3\r\nАктивное шумоподавление:\r\nесть\r\nВремя работы:\r\nдо 10 ч\r\nСтепень пылевлагозащиты:\r\nIP57'),
(14, 'Беспроводные/проводные наушники Marshall Major V черный 2024', 8199.00, 9499.00, 23, 'Аудиотехника', 4.7, 201, '7dde57929a7052a80ee0cb23bea558c3e2fefe222cb4e3c3b38015d9e9585f6f.jpg.webp', 'Накладные наушники Marshall Major V в черном цвете имеют формат стереосистемы 2.0. Он предполагает равномерное распределение звука по двум колонкам и обеспечивает чистый, объемный звук в частотном диапазоне от 20 до 20000 Гц. Это значит, что в этих наушниках будет комфортно прослушивать музыку как с высокими нотами, так и с басами.\r\nНаушники Marshall Major V можно подключить к смартфону по Bluetooth на расстоянии до 10 м. На одном заряде устройство будет проигрывать аудио до 100 ч. Восстановить заряд можно с помощью функции быстрой зарядки через кабель USB Type-C из комплекта. Для проводного подключения телефона предусмотрен кабель кабель jack 2.5 mm - jack 3.5 mm. На смартфон можно скачать приложение Marshall Bluetooth для управления. Переключать треки, ставить их на паузу, а также принимать звонки вы сможете также через голосового помощника или механическими кнопками.', 'Тип конструкции:\r\nнакладные\r\nТип соединения:\r\nпроводной, Bluetooth 5.3, кабель 1.2 м\r\nВремя работы:\r\nдо 100 ч\r\nБеспроводная зарядка:\r\nесть\r\nДиапазон частот:\r\n20 Гц - 20000 Гц\r\nСопротивление:\r\n32Ω'),
(15, '11\" Планшет Apple iPad (11th Gen) Wi-Fi 128 ГБ розовый', 30999.00, 35999.00, 20, 'Планшеты', 4.6, 76, '0f34320499fd55046f4822350223b874d505d500e0d89a1e085930872efb4382.jpg.webp', 'Теперь с супербыстрым чипом A16 и большим объемом встроенной памяти Apple iPad (11th Gen) стал еще более функциональным, чем когда-либо. Выполняйте задания, самовыражайтесь и оставайтесь погруженными в любимые занятия — все это на потрясающем 11-дюймовом дисплее Liquid Retina. Снимайте контент с помощью широкоугольной задней камеры 12 Мп . Ретушируйте фотографии, редактируйте видео, распознавайте объекты на фотографиях и видео с помощью Visual Look Up, а также сканируйте и делайте пометки в документах — все это на iPad.', 'Дисплей:\r\n2360x1640, IPS, 60 Гц\r\nОС:\r\niPadOS 18\r\nПроцессор:\r\nApple A16 Bionic, 5x3.46 ГГц\r\nПамять (ОЗУ/ПЗУ):\r\n6 ГБ/128 ГБ\r\nСвязь:\r\nWi-Fi 4 (802.11n), 5 (802.11ac), 6 (802.11ax)\r\nПитание:\r\n7606 мА*ч\r\n'),
(16, '11\" Планшет Xiaomi REDMI Pad 2 Wi-Fi 256 ГБ серый', 18599.00, 24999.00, 20, 'Планшеты', 4.6, 76, 'adf8895f945cd0f3a6b18228277567ef9b981ca302d637c2af58c09392e5ec8b.jpg.webp', 'Серый планшет Xiaomi REDMI Pad 2 Wi-Fi на базе Android допускает установку сторонних приложений для работы и развлечений. При нехвате 256 ГБ памяти можно устанавливать microSD объемом до 2 ТБ. Мощности 8-ядерного процессора с 6 ГБ ОЗУ хватает для исправной работы нескольких открытых приложений и игр.\r\n11-дюймовый экран удобен для просмотра фильмов, чтения текста и редактирования фото. IPS-матрица отображает более 1 млрд цветов и сохраняет четкость картинки в разрешении 2560x1600. Частоты обновления 90 Гц хватает для скроллинга веб-страниц и текста без расплывания букв.\r\nXiaomi REDMI Pad 2 Wi-Fi без слотов для SIM-карт поддерживает выход в интернет по Wi-Fi. С помощью Bluetooth вы можете передавать данные между устройствами. Камера с распознаванием лица позволяет использовать биометрию для разблокировки экрана без ввода пароля. 4 динамика с Dolby Atmos выдают чистый стереозвук для комфортного просмотра видео и прослушивания музыки.', 'Дисплей:\r\n2560x1600, IPS, 90 Гц\r\nОС:\r\nAndroid 15.x\r\nПроцессор:\r\nMediaTek Helio G100 Ultra, 8x2.2 ГГц\r\nПамять (ОЗУ/ПЗУ):\r\n8 ГБ/256 ГБ\r\nСвязь:\r\nWi-Fi 4 (802.11n), 5 (802.11ac)\r\nСлот для карты до 2048 ГБ:\r\nесть'),
(17, 'Фитнес-браслет Xiaomi Smart Band 10', 3699.00, 4000.00, 2, 'Умные часы', 4.4, 156, '233b16db498c1ceb275ed36d54b4a96fa6d508afb8a0cef8a392a4408f27b3aa.jpg.webp', 'Фитнес-браслет Xiaomi Smart Band 10 предназначен для мониторинга физической активности в течение дня и контроля показателей состояния организма. Встроенные датчики позволяют отслеживать пульс, количество шагов и пройденное расстояние, а также продолжительность сна. Для усиления эффективности занятий спортом есть 150 предустановленных тренировок.\r\nМодель Xiaomi Smart Band 10 можно синхронизировать со смартфонами, работающими на операционных системах Android 8.0, iOS 14 и выше. После подключения браслет будет оповещать о звонках, SMS-сообщениях, а также уведомлениях от приложений. Вся информация размещается на сенсорном дисплее диагональю 1.72\". Благодаря яркости 1500 Кд/м² контент на экране будет виден даже на улице в солнечную погоду. Также фитнес браслет имеет функции будильника, таймера и компаса.', 'Экран:\r\n1.72\" AMOLED, 520x212\r\nИзмерения:\r\nколичество шагов, продолжительность и качество сна, пройденное расстояние, пульс\r\nСтепень защиты:\r\nIP68\r\nВремя работы:\r\n504 ч\r\nБеспроводная связь:\r\nBluetooth'),
(18, 'Смарт-часы HUAWEI WATCH GT 6 Pro 46 mm', 21199.00, 28999.00, 2, 'Умные часы', 4.4, 156, 'b5c2c5363e1aa5ddf78130ca0a97ba36de62a1dff4ef5012e0944c5c0ccf52df.jpg.webp', 'Смарт-часы HUAWEI WATCH GT 6 Pro 46 mm позволят заниматься спортом на улице и в зале. Влагозащита корпуса даст возможность плавать, не снимая устройство. Модель поможет контролировать расход калорий, пройденное расстояние, продолжительность и качество сна, сердечный ритм, уровень стресса и восстановления. 100 предустановленных тренировок позволят точно рассчитывать физические нагрузки. Органайзер оснащен будильником, компасом, фонариком, календарем и прогнозом погоды. Системы навигации позволят определить местоположение пользователя с точностью до 3 м. HUAWEI WATCH GT 6 Pro 46 mm подключается к смартфонам с ОС Android 8.0 и выше, iOS 13 и выше. При подключении пользователь может управлять прослушиванием музыки, принимать звонки, управлять камерой, читать сообщения. Полностью заряженная батарея позволит пользоваться часами в активном режиме до недели. Модель поддерживает беспроводную зарядку.', 'Экран:\r\n1.47\" AMOLED, 466x466\r\nИзмерения:\r\nколичество шагов, потраченные калории, продолжительность и качество сна, пройденное расстояние\r\nСтепень защиты:\r\nIP68, IP69\r\nВремя работы:\r\n504 ч\r\nБеспроводная связь:\r\nBluetooth, NFC\r\nНавигация:\r\nBeiDou, Galileo, GPS, QZSS');

-- --------------------------------------------------------

--
-- Структура таблицы `productshome`
--
-- Создание: Сен 07 2026 г., 11:01
--

DROP TABLE IF EXISTS `productshome`;
CREATE TABLE `productshome` (
  `id` int NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `image_path` varchar(255) COLLATE utf8mb4_general_ci NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `productshome`
--

INSERT INTO `productshome` (`id`, `name`, `price`, `image_path`) VALUES
(1, 'Смартфон', 29999.00, '2258685cc32bbd96de406852bd9b2d94916029658cd6fa120a9f97a4bc0af297.jpg.webp'),
(2, 'Ноутбук', 59999.00, 'f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg.webp'),
(3, 'Наушники PRO', 4999.00, '73dd06c0a2d4c9ff74cfaafaedec60012cae0a437e72ed35351e0fa8fa203289.jpg.webp');

-- --------------------------------------------------------

--
-- Структура таблицы `sales_products`
--
-- Создание: Сен 07 2026 г., 11:21
-- Последнее обновление: Сен 19 2026 г., 13:40
--

DROP TABLE IF EXISTS `sales_products`;
CREATE TABLE `sales_products` (
  `id` int NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `price` decimal(10,2) NOT NULL,
  `oldPrice` decimal(10,2) DEFAULT NULL,
  `discount` int DEFAULT NULL,
  `category` varchar(100) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `rating` decimal(3,2) DEFAULT NULL,
  `reviews` int DEFAULT NULL,
  `image` varchar(255) COLLATE utf8mb4_general_ci DEFAULT NULL,
  `saleEnds` date DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `sales_products`
--

INSERT INTO `sales_products` (`id`, `name`, `price`, `oldPrice`, `discount`, `category`, `rating`, `reviews`, `image`, `saleEnds`) VALUES
(1, '6.7\" Смартфон Samsung Galaxy A56 256 ГБ черный', 32999.00, 60999.00, 14, 'Смартфоны', 4.80, 124, '831a385f76f265293448bc5b858ab3d74053e6cf4ada47e0649b959d7bcb5567.jpg.webp', '2026-09-19'),
(2, '16\" Ноутбук HUAWEI MateBook D 16 2024 MCLF-X серый', 54999.00, 64999.00, 15, 'Ноутбуки', 4.90, 89, 'f8c1d514292bd887b7279a1fa5f26692c8c70e6dd1ca86b6a8a7b3a4f4b6b0bd.jpg.webp', '2026-12-25'),
(3, 'Беспроводные/проводные наушники Marshall Major V черный 2024', 8199.00, 9499.00, 23, 'Аудиотехника', 4.70, 201, '7dde57929a7052a80ee0cb23bea558c3e2fefe222cb4e3c3b38015d9e9585f6f.jpg.webp', '2026-11-30'),
(4, '11.5\" Планшет HUAWEI MatePad 11.5 (2025) Wi-Fi 256 ГБ фиолетовый + клавиатура + чехол', 30999.00, 24999.00, 20, 'Планшеты', 4.60, 76, '4c50e9737ae8188a63bd98b1bfeb429bef560e3599fea1c03b45e8d06bb400cb.jpg.webp', '2026-12-15');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--
-- Создание: Сен 19 2026 г., 12:34
-- Последнее обновление: Сен 19 2026 г., 12:39
--

DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` int NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `name` varchar(50) COLLATE utf8mb4_general_ci NOT NULL,
  `role` enum('user','admin') COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'user'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `email`, `password`, `name`, `role`) VALUES
(14, 'kill@kill.ru', 'DEMO_PASSWORD', 'Пользователь 1', 'user'),
(18, 'test123@mail.ru', 'DEMO_PASSWORD', 'Пользователь 2', 'user'),
(19, 'admin@mail.ru', 'DEMO_PASSWORD', 'Администратор', 'admin');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `banned_words`
--
ALTER TABLE `banned_words`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `word` (`word`),
  ADD KEY `idx_word` (`word`);

--
-- Индексы таблицы `cart_items`
--
ALTER TABLE `cart_items`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `cities`
--
ALTER TABLE `cities`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `new_user_carts`
--
ALTER TABLE `new_user_carts`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `user_id_unique` (`user_id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `productshome`
--
ALTER TABLE `productshome`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `sales_products`
--
ALTER TABLE `sales_products`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `banned_words`
--
ALTER TABLE `banned_words`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=282;

--
-- AUTO_INCREMENT для таблицы `cart_items`
--
ALTER TABLE `cart_items`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `cities`
--
ALTER TABLE `cities`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `new_user_carts`
--
ALTER TABLE `new_user_carts`
  MODIFY `id` int NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=13;

--
-- AUTO_INCREMENT для таблицы `productshome`
--
ALTER TABLE `productshome`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT для таблицы `sales_products`
--
ALTER TABLE `sales_products`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
